Table of Contents
 Class MaterialBoltGradeHKG
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Material bolt grade
[OpenModelClass("CI.StructModel.Libraries.Material.HKG.MaterialBoltGradeHKG, CI.Material", "CI.StructModel.Libraries.Material.IMatBoltGradeHKG, CI.BasicTypes", typeof(MaterialBoltGrade))]
public class MaterialBoltGradeHKG : MaterialBoltGrade
Inheritance
object
OpenObject
OpenElementId
Material
MaterialBoltGrade
MaterialBoltGradeHKG
Inherited Members
 MaterialBoltGrade.fub
 MaterialBoltGrade.fyb
 MaterialBoltGrade.Elongation
 MaterialBoltGrade.Code
 MaterialBoltGrade.MprlElementID
 MaterialBoltGrade.MprlTableID
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Pbb
Design bearing strength
public double Pbb { get; set; }
Property Value
double
 Ps
Design shear strength
public double Ps { get; set; }
Property Value
double
 Pt
Design tension strength
public double Pt { get; set; }
Property Value
double
 Edit this page